{
  "version": "1.0",
  "content": "<h1>Terms of Service</h1><p><strong>Last Updated: January 1, 2025</strong></p><h2>1. Introduction</h2><p>Welcome to our trading platform. These Terms of Service ('Terms') govern your access to and use of our website, mobile applications, and trading services (collectively, the 'Services'). By accessing or using our Services, you agree to be bound by these Terms.</p><p>If you do not agree to these Terms, you must not access or use our Services. We may modify these Terms at any time, and such modifications will be effective immediately upon posting. Your continued use of the Services after any such modifications constitutes your acceptance of the modified Terms.</p><h2>2. Eligibility</h2><p>To use our Services, you must:</p><ul><li>Be at least 18 years old (or the age of majority in your jurisdiction)</li><li>Have the legal capacity to enter into binding contracts</li><li>Not be prohibited from using our Services under applicable laws</li><li>Provide accurate and complete information during registration</li><li>Maintain the security of your account credentials</li></ul><p>We reserve the right to refuse service, terminate accounts, or limit access to our Services at our sole discretion.</p><h2>3. Account Registration</h2><p>To access certain features, you must register for an account. You agree to:</p><ul><li>Provide accurate, current, and complete information</li><li>Maintain and update your information to keep it accurate</li><li>Maintain the security of your password and account</li><li>Accept responsibility for all activities under your account</li><li>Notify us immediately of any unauthorized use</li><li>Complete identity verification (KYC) as required</li></ul><h2>4. Trading Services</h2><p>Our platform provides access to foreign exchange and other financial instrument trading. You acknowledge that:</p><ul><li>Trading involves substantial risk of loss</li><li>Past performance does not guarantee future results</li><li>You may lose all or more than your initial investment</li><li>You should only trade with funds you can afford to lose</li><li>You understand the risks associated with leveraged trading</li></ul><h2>5. Deposits and Withdrawals</h2><p>You may deposit funds to your account using approved payment methods. Withdrawals are subject to:</p><ul><li>Account verification requirements</li><li>Processing times as disclosed</li><li>Minimum withdrawal amounts</li><li>Security and compliance checks</li><li>Withdrawal fees as applicable</li></ul><p>We reserve the right to request additional documentation for withdrawals and to delay or refuse withdrawals for security or compliance reasons.</p><h2>6. Fees and Charges</h2><p>Our fee structure includes:</p><ul><li>Spreads on trades</li><li>Commissions (where applicable)</li><li>Overnight swap fees</li><li>Withdrawal fees</li><li>Inactivity fees (if applicable)</li></ul><p>All fees are disclosed on our website and may be updated from time to time. You are responsible for reviewing and understanding all applicable fees.</p><h2>7. Risk Disclosure</h2><p>Trading financial instruments carries a high level of risk and may not be suitable for all investors. The high degree of leverage can work against you as well as for you. Before deciding to trade, you should carefully consider:</p><ul><li>Your investment objectives</li><li>Your level of experience</li><li>Your risk tolerance</li><li>Whether you can afford to lose your investment</li></ul><p>You should seek independent financial advice if you have any doubts.</p><h2>8. Prohibited Activities</h2><p>You agree not to:</p><ul><li>Use the Services for any illegal purpose</li><li>Violate any applicable laws or regulations</li><li>Infringe on intellectual property rights</li><li>Transmit viruses or malicious code</li><li>Attempt to gain unauthorized access</li><li>Interfere with or disrupt the Services</li><li>Use automated trading systems without authorization</li><li>Engage in market manipulation</li><li>Create multiple accounts to circumvent limits</li></ul><h2>9. Intellectual Property</h2><p>All content, features, and functionality of the Services are owned by us or our licensors and are protected by copyright, trademark, and other intellectual property laws. You may not:</p><ul><li>Reproduce, distribute, or create derivative works</li><li>Use our trademarks or logos without permission</li><li>Reverse engineer or decompile our software</li><li>Remove copyright or proprietary notices</li></ul><h2>10. Privacy</h2><p>Your use of our Services is also governed by our Privacy Policy, which is incorporated into these Terms by reference. Please review our Privacy Policy to understand how we collect, use, and protect your information.</p><h2>11. Limitation of Liability</h2><p>To the maximum extent permitted by law:</p><ul><li>We provide the Services 'as is' without warranties</li><li>We are not liable for trading losses</li><li>We are not liable for indirect, incidental, or consequential damages</li><li>Our total liability is limited to fees paid in the 12 months prior to the claim</li></ul><p>This limitation does not apply to fraud, willful misconduct, or where prohibited by law.</p><h2>12. Indemnification</h2><p>You agree to indemnify and hold us harmless from any claims, damages, losses, liabilities, and expenses (including legal fees) arising from:</p><ul><li>Your use of the Services</li><li>Your violation of these Terms</li><li>Your violation of any law or regulation</li><li>Your infringement of any third-party rights</li></ul><h2>13. Termination</h2><p>We may terminate or suspend your account and access to Services immediately, without prior notice, for:</p><ul><li>Violation of these Terms</li><li>Fraudulent activity</li><li>Legal or regulatory requirements</li><li>Extended account inactivity</li><li>Any other reason at our sole discretion</li></ul><p>You may close your account at any time by contacting support. Upon termination, you remain liable for all obligations incurred prior to termination.</p><h2>14. Dispute Resolution</h2><p>Any disputes arising from these Terms or the Services shall be resolved through:</p><ol><li>Good faith negotiation</li><li>Mediation (if negotiation fails)</li><li>Binding arbitration (if mediation fails)</li></ol><p>You agree to waive any right to a jury trial or class action lawsuit, except where prohibited by law.</p><h2>15. Regulatory Compliance</h2><p>We operate in compliance with applicable financial regulations. You are responsible for:</p><ul><li>Complying with laws in your jurisdiction</li><li>Determining if our Services are legal in your location</li><li>Paying any applicable taxes on trading profits</li></ul><h2>16. Force Majeure</h2><p>We are not liable for any failure to perform due to circumstances beyond our reasonable control, including but not limited to:</p><ul><li>Natural disasters</li><li>War or terrorism</li><li>Government actions</li><li>Internet or telecommunications failures</li><li>Market disruptions</li></ul><h2>17. Changes to Services</h2><p>We reserve the right to:</p><ul><li>Modify or discontinue any aspect of the Services</li><li>Change fees and charges</li><li>Update features and functionality</li><li>Impose limits on usage</li></ul><p>We will provide reasonable notice of material changes when possible.</p><h2>18. Governing Law</h2><p>These Terms are governed by and construed in accordance with the laws of [Jurisdiction], without regard to conflict of law principles. Any legal action must be brought in the courts of [Jurisdiction].</p><h2>19. Severability</h2><p>If any provision of these Terms is found to be unenforceable, the remaining provisions will remain in full force and effect.</p><h2>20. Entire Agreement</h2><p>These Terms, together with our Privacy Policy and Risk Warning, constitute the entire agreement between you and us regarding the Services.</p><h2>21. Contact Information</h2><p>If you have questions about these Terms, please contact us at:</p><p>Email: legal@example.com<br>Address: [Company Address]<br>Phone: [Phone Number]</p><p>By using our Services, you acknowledge that you have read, understood, and agree to be bound by these Terms of Service.</p>",
  "effective_date": "2025-01-01",
  "language": "en"
}
